'use client';

import React from 'react';
import TermModal from './TermModal';

interface Props {
  onClose?: () => void;
}

function ServiceModal({ onClose }: Props) {
  return (
    <TermModal title="서비스 이용약관" onClose={onClose}>
      <section>
        <h3 className="font-semibold">제 1조 목적</h3>
        <p>
          본 이용약관(이하 약관이라 함)은 주식회사 시스메틱(이하 회사라 함)이 제공하는 모야 서비스(이하 서비스라 함)의
          이용에 관하여 회사와 본 서비스를 이용하는 (이하 회원이라 함)과의 권리, 의무 및 책임 사항, 기타 필요한 사항
          규정을 목적으로 합니다.
        </p>
        <ol className="box-border list-decimal px-4 py-8">
          <li>서비스를 이용하고자 하는 회원은 본 약관의 규정에 따라 이용해야만 합니다.</li>
          <li>비회원의 경우 회사가 제공하는 서비스기능에 대해 이용이 불가능합니다.</li>
          <li>
            본 서비스에 개별 이용약관이 존재할 경우, 고객은 본 약관 외에 개별 이용약관의 규정에 따라 본 서비스를
            이용해야 합니다. 회사는 합리적인 사유에 의거해 약관을 변경할 수 있으며, 약관이 변경될 경우 이를 공시합니다.
            본 약관의 조건에 따라, 회사는 회원에게 서비스를 사용할 수 있는 제한적이며 이전 불가능한, 비배타적,
            비상업적인 권리를 부여합니다.
          </li>
        </ol>
      </section>
      <section>
        <h3 className="font-semibold">제 2조 용어의 정의</h3>
        <p>본 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
        <ol className="box-border list-decimal px-4 py-8">
          <li>
            서비스: 접속 가능한 유무선 단말기의 종류와는 상관없이 이용 가능한, 회사가 제공하는 모든 서비스를 의미합니다.
            회원: 회사와 서비스 이용 계약을 체결하고, 서비스에 접속하여 본 약관에 따라 회사가 제공하는 서비스를 이용하는
            개인 또는 기업을 의미합니다.
          </li>
          <li>
            아이디(ID): 고객의 식별과 서비스 이용을 위하여 고객이 정하고 회사가 승인하는 로그인 수단(e-mail, facebook
            ID, google+ ID)을 의미합니다.
          </li>
          <li>
            비밀번호: 회원이 부여 받은 아이디(ID) 와 일치하는 회원의 비밀보호를 위해 회원 자신이 설정한 문자, 숫자의
            조합을 의미합니다.
          </li>
          <li>
            유료 서비스: 회사가 유료로 제공하는 각종 서비스(아이템 등 월 또는 년으로 비용을 지불 하는 서비스) 및 제반
            서비스를 의미합니다. 애플리케이션이란 iOS와 AndroidOS에서 이용할 수 있도록 설계되어, 앱스토어나 구글
            플레이스토어 등의 플랫폼을 통하여 배포되는 무선 통신장치용 프로그램을 의미합니다.
          </li>
        </ol>
      </section>
      <section>
        <h3 className="font-semibold">제 3조 약관의 명시와 설명 및 개정</h3>
        <p>
          본 약관은 회사가 제공하는 서비스의 내용과 회사정보와 함께 회원이 쉽게 확인 할 수 있도록 모야 APP과
          웹사이트(http://watch.moya.ai/policy)에 게시합니다. 회사는 약관의 규제에 관한 법률. 정보통신망 이용촉진 및
          정보보호 등에 관한 법률 등에 관계법령을 위배하지 않는 범위에서 이 약관을 개정 할 수 있습니다. 회사가 약관을
          개정할 경우에는 적용일자 및 개정사유를 명시하여야 하며, 약관이 변경되었음을 적용일자 30일 전부터 적용일자까지
          공지해야 합니다. 회원에게 불리한 약관개정의 경우에는 공지 외에 일정기간 서비스 내 공지사항, 전자우편, 로그인
          시 동의 창 등 전자적 수단을 통해 명확히 통지합니다. 회원이 개정약관에 동의하지 않는 경우 회사는 개정 약관의
          내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수 있습니다. 약관 개정 시, 기존 약관을 적용할 수
          없는 특별한 사정이 있는 경우에는 회사는 이용계약을 해지할 수 있으며 회원이 가입한 유료서비스 이용기간이 남아
          있는 경우, 유료서비스 환불은 7조 “유료서비스 결제 및 환불정책”을 따릅니다. 회원이 지속적으로 접속하거나,
          서비스를 이용하는 것은 회원이 약관의 가장 최신 버전을 승인했음을 의미합니다.
        </p>
      </section>
      <section className="my-8">
        <h3 className="font-semibold">제 4조 약관 외 준칙</h3>
        <p>
          회사는 유료 서비스 및 개별 서비스에 대해서는 별도의 이용약관 및 정책(이하 유료 서비스약관 등)을 둘 수 있으며,
          해당 내용이 이 약관과 상충할 경우에는 유료 서비스약관 등이 우선하여 적용됩니다. 이 약관에서 정하지 아니한
          사항이나 해석에 대해서는 유료 서비스약관 등 및 관계법령(&quot;정보통신망 이용촉진 및 정보보호등에 관한
          법률&quot;, &quot;약관의 규제에 관한 법률, 전기통신사업법&quot; 등) 또는 상관례에 따릅니다.
        </p>
      </section>
      <section className="my-8">
        <h3 className="font-semibold">제 5조 이용계약 체결</h3>
        <p>
          이용계약은 회원이 되고자 하는 자가 약관의 내용에 대하여 동의를 한 다음 회원 가입신청을 하고 회사가 이를
          승낙하여 체결됩니다. 회사는 가입신청자의 신청을 즉시 승낙함을 원칙으로 합니다. 다만, 다음에 해당하는 신청에
          대하여는 승낙을 하지 않거나 사후에 계약을 해지할 수 있습니다. 가입신청자가 이 약관에 의해 회원자격을 상실한
          적이 있는 경우. 단, 회사의 재가입 승낙을 얻은 경우는 예외로 함 허위의 정보를 기재하거나, 회사가 제시하는
          내용을 기재하지 않은 경우(facebook ID, e-mail, google+ ID 도용 등) 회원의 귀책사유로 인해 승인이 불가하거나,
          기타 규정을 위반하여 신청하는 경우 2항 b호에 해당되는 경우 부정한 목적과 방법으로 이용신청을 한 회원의 계정은
          사전 통지 없이 삭제될 수 있으며, 관법령에 따라 처벌을 받을 수 있습니다. 회사는 기술상 또는 업무상 문제가 있는
          경우에는 승낙을 유보할 수 있으며, 이런 경우 회사는 이를 가입신청자에게 고지합니다. 이용계약의 성립 시기는
          회사가 가입완료를 신청절차 상에서 표시한 시점으로 합니다. 회사는 회원에 대해 회사 정책에 따라 등급별로
          구분하여 이용범위, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.
        </p>
      </section>
      <section className="my-8">
        <h3 className="font-semibold">제 6조 애플리케이션</h3>
        <p>
          사용 애플리케이션의 기존 버전을 사용할 수 있는 회원의 권리는 회원의 기기에 설치된 애플리케이션의 가장 최신
          버전을 받을 수 있거나 보유하게 되는 즉시 소멸합니다 회원 다음과 같은 행위를 할 수 없습니다. 애플리케이션의
          임대, 재허락, 발행, 수정, 개조, 또는 분해 애플리케이션을 탑재할 권한이 없는, 불법적인, 위조 또는 개조된
          하드웨어나 소프트웨어의 사용 애플리케이션의 이전 버전 재설치(&quot;다운그레이드&quot;) 애플리케이션에
          접속하거나 애플리케이션을 이용하는 것과 관련한 모든 법률, 규칙 또는 회사나 제3자의 지위 또는 권리 위반행위
          회사를 통하지 않고 다른 방식으로 애플리케이션을 취득함
        </p>
      </section>
      <section className="my-8">
        <h3 className="font-semibold">제 7조 유료 서비스 결제 및 환불</h3>
        <p>
          회원은 유료서비스에 대하여 다음의 방법 중 가능한 방법을 선택하여 결제할 수 있으며, 회사는 회원이 선택한
          결제방법에 대하여 어떠한 명목의 수수료도 추가하여 징수하지 않습니다. 단, 회원이 선택한 결제수단의 제공업체가
          별도로 존재할 경우, 회원은 해당 결제수단에서 요구되는 절차를 이행하여야 합니다. 아이폰 및 안드로이드 등
          플랫폼을 통한 인앱결제 회원은 유료서비스를 이용할 때 다음에 해당하는 행위를 하여서는 안됩니다. 비정상적인
          방법으료 유료서비스를 이용하거나 시스템에 접근 타인의 명의, 결제정보를 도용하여 회사의 유료서비스를 이용 기타
          불법적이거나 부당한 행위 유료서비스는 구독 형태로 제공되며, 자동 구독 갱신이 꺼져있지 않은 경우 현재 구독기간
          종료 24시간 전에 다음 구독이 갱신됩니다. 구독 취소는 앱을 다운로드 받은 플랫폼의 정책을 따릅니다. 회원에게
          유료서비스 이용을 위한 대금이 잘못 과금된 경우, 회사는 회원이 대금을 결제한 방법과 동일한 방법으로 과금된
          금액을 환불합니다. 회사는 유료서비스를 연중무휴, 1일 24시간 제공함을 원칙으로 합니다. 회사는 정보통신설비의
          보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 유료서비스의 제공을 일시적으로 중단할 수
          있고, 이 경우 회사는 이를 회원에게 통지합니다. 단, 회사가 사전에 통지할 수 없는 사유가 있는 경우 이를 사후에
          통지할 수 있습니다. 회사는 상당한 이유가 있는 경우, 제공하고 있는 전부 또는 일부의 유료서비스를 변경할 수
          있습니다. 단, 변경된 내용이 중대하거나 회원에게 불리한 경우에는 회사가 해당 유료서비스를 제공받는 회원에게
          통지합니다. 회원은 유료서비스 이용 전 회사가 제공하는 유료서비스의 상세 내용과 거래의 조건을 정확히 확인한 후
          구매햐여야 합니다. 이를 확인하지 않고 구매하여 발생한 손실 및 손해는 회원에게 귀속됩니다. 회사가 관계 법령의
          변경, 천재지변 또는 이에 준하는 불가항력으로 인해 유료서비스를 재공할 수 없는 경우에는 유료서비스 제공에 대한
          책임이 면제됩니다. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「정보통신망 이용촉진 및
          정보보호에 관한 법률」, 「콘텐츠산업진흥법」, 「전자상거래등에서의 소비자보호에 관한 법률」, 「약관의 규제에
          관한 법률」, 문화체육관광부장관이 정하는 「디지털콘텐츠 이용자보호지침」 및 기타 관계 법령, 또는 상관례에
          따릅니다.
        </p>
      </section>
      <section className="my-8">
        <h3 className="font-semibold">제 8조 회원정보의 변경 및 탈퇴</h3>
        <p>
          회원은 설정 페이지에서 로그인 ID를 열람하거나 탈퇴할 수 있습니다. 서비스 관리를 위해 필요한 로그인ID, 성별은
          수정이 불가능합니다. 로그인 비밀번호는 비밀번호 찾기 기능을 이용해 변경 가능합니다. 제 8조 인터넷 접속
          애플리케이션을 포함한 서비스는 인터넷 접속을 필요로 할 수 있으며, 인터넷 접속 및 사용에 따른 요금 발생은
          회원의 책임 하에 있습니다.
        </p>
      </section>
      <section className="my-8">
        <h3 className="font-semibold">제 9조 연락처</h3>
        <p>만약 회원이 서비스에 대한 질문 또는 불만족스러운 부분이 있을 경우 다음의 연락처로 연락 주시기 바랍니다.</p>
        <address>moya.ai / help@moya.ai</address>
      </section>
      <section className="my-8">
        <h3 className="font-semibold">제 10조 부칙</h3>
        <p>이 약관은 2023년 01월 01일부터 적용됩니다.</p>
        <p>이용약관 버전번호: 2.1</p>
        <p>
          공고일자 : <time>2023년 01월 01일</time>
        </p>
        <p>
          시행일자 : <time>2023년 01월 01일</time>
        </p>
      </section>
    </TermModal>
  );
}

export default ServiceModal;
